<?php

namespace Faker\Provider\th_TH;

class Payment extends \Faker\Provider\Payment
{





protected static $banks = [
'ธนาคารแห่งประเทศไทย',
'ธนาคารกรุงเทพ',
'ธนาคารกรุงศรีอยุธยา',
'ธนาคารกสิกรไทย',
'ธนาคารเกียรตินาคิน',
'ธนาคารซีไอเอ็มบีไทย',
'ธนาคารทหารไทย',
'ธนาคารทิสโก้',
'ธนาคารไทยพาณิชย์',
'ธนาคารไทยเครดิตเพื่อรายย่อย',
'ธนาคารธนชาต',
'ธนาคารยูโอบี',
'ธนาคารแลนด์ แอนด์ เฮาส์',
'ธนาคารสแตนดาร์ดชาร์เตอร์ด (ไทย)',
'ธนาคารกรุงไทย',
'ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย',
'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร',
'ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย',
'ธนาคารออมสิน',
'ธนาคารอาคารสงเคราะห์',
'ธนาคารอิสลามแห่งประเทศไทย',
'ธนาคารไอซีบีซี (ไทย)',
];




public static function bank()
{
return static::randomElement(static::$banks);
}
}
