<?php

namespace Faker\Provider\kk_KZ;

class Text extends \Faker\Provider\Text
{
/**
@licence


















*/
protected static $baseText = <<<'EOT'
Арыстан баб кесенесі - көне Отырар жеріндегі сәулет өнері ескерткіші.

Түркістан халқының арасында мұсылман дінін таратушы Қожа Ахмет Иасауидің ұстазы болған Арыстан баб ата
қабірінің басына салынған. Кесене дәлізхана, мешіт, құжырахана, азан шақыратын мұнара сияқты жеке бөлмелерден құралған.
Кесененің ең көне бөлігі қабірхана болуы тиіс. Қазір де оның едені басқа бөлмелермен салыстырғанда едәуір биік.
Қабір үстіне алғашқы белгі 12 ғ. шамасында салынған. Мазар 14 ғасырда қайта жөнделген. Арыстан баб кесенесі 20 ғасырдың
басында жергілікті халықтың қаражатымен күйдірілген кірпіштен ауданы 35x12 м, биіктігі 12 м, бұрынғы Меккеге қараған
есігі Түркістанға, Әзірет Сұлтанға бағытталып, Солтүстік жағы кесене, Оңтүстік жағы мешіт есебінде қайта жәнделді.
Дәліз-қақпа маңдайшасына мәрмәр тақта қаланып, бетіне һижра бойынша 1327 жыл, яғни соңғы құрылыс жүрген
уақыт деп көрсетілген.

Қысқаша мәлімет

Бұл кесене XII ғасырда өмір сүрген діни көріпкел Арыстан баб мазарының үстіне салынған.
Кесененің бірінші құрылысы XIV-XV ғасырға жатады. Сол құрылыстан кесілген айван тізбектері қалған.
XVIII ғасырда көне мазардың орнында жер сілкінісінен кейін екі кесілген ағаш тізбекке тірелген айванмен салынған
екі күмбезді құрылыс орнатылды. XVIII ғасырда құрылыс қиратылып, фриз жазбалары бойынша 1909 жылы қайта салынды.
1971 жылы жоғары деңгейдегі грунт сулары салдарынан мешіт құлатылып, қайта орнатылды. Құрылыс алебастр ерітіндісінде
күйдірілген кірпіштен қабырғаның сырт жағына салынды. Қазіргі кезде бұл кесене Орталық Азиядағы қажылық міндетті
өтейтін мұсылман киелі жерлерінің бірі болып саналады Аңыз бойынша Арыстан баб Мұхаммед пайғамбардың елшісі болған.
Бір күні Мұхаммед пайғамбар өзінің шәкірттерімен құрма жеп отырған еді. Бір құрма қайта-қайта ыдыстан құлай беріп,
пайғамбар ішкі дауысты естіді: «Бұл құрма Сізден кейін 400 жыл алдағы уақытта туылатын мұсылман бала Ахметке арналған».
Сонда пайғамбар шәкірттері ішінен бұл құрманы кім иесіне жеткізетінін сұрайды. Ешкім сұранған жоқ. Пайғамбар сұрақты
қайта қойғаннан кейін, Арыстан баб былай деді: «Егер Сіз Алла Тағаладан 400 жыл сұрап берсеңіз мен бұл құрманы
иесіне жеткіземін». Халық аңыздарынан және жазба деректеріне қарағанда («Рисолаи Сарем-Исфижоб» және
Куприлозада кітабы) Арыстан баб Ахмет Яссауидің ұстазы болып құрманы жеткізеді. Қазіргі кезде Арыстан баб мазары
үстінде 30*13 метр аумағы бар кесене тұр. Тарихи деректер бойынша XII-XVIII ғасырларда кесене бірнеше рет қайта
салынып, қайта жаңартылды. Қожа Ахмет Яссауи ұлы әулие мен діни көріпкел 1103 жылы туылып 1166 жылы қайтыс болған.
Арыстанбаб туралы аңыздар

Арыстанбабтың дүние салуы Қожа Ахмет Иасауи хикметінде былайша суреттеледі:
«Бабам айтты: Ей балам, қасымда тұр өлейін,
Жаназамды оқып көм, жан тәсілім қалайын.
Медет берсе Мұстафа, ғарыш биігіне шығайын.
Арыслан бабам сөздерін есітіңіз - тәбәрік.
Жылап айттым: ей бала, жас көдекпін білмеймін.
Көріңізді қазармын, көтеріп сала алмаспын.
Хақ Мұстафа сүндетін, балапанмын, білмеймін.
Бабам айтты: Ей балам, періштелер жиылады.
Жебірейіл имам болып, өзгелер оған ұйиды.
Макаил мен Исрафил көтеріп көрге қояды».Отырар өңірінде біз естіген аңыз байынша Арыстанбаб дүние салған соң,
оның денесін ақ бураға артып, еркіне жіберіп, соңынан ілесіп отырған. Ақ бура жүре-жүре осы жерге шөккен екен.
Сол шөккен жерге Арыстанбаб қойылыпты. «Алпамыс жырының» бір үлгісінде Байбөрі мен Аналық «Самарқанда сансыз баб»,
Бұқарадағы «Баһауәдин Нақишбент» молаларына зират қылады, және
"Түнейді үш күн Байбөрі
Әзіретті сұлтанға.
Түркістанда түмен бап,
Сайрамда бар сансыз бап,
Отырарда отыз бап,
Бабалардың бабын сұрасаң,
Ең үлкені Арыстан бап.
Әулие қоймай қыдырып,
Бабалардың бәрін қылды сап» Әзірет Сұлтан қорық-музейінің сақтаулы тұрған Баян ауылдан бір зияратшылдың
қолжазбасында мынадай қызық мағұлмат бар: Арыстанбаб дүние салған соң, оның моласының басына екі құс – бірі лашын,
бірі қарға ұшып келеді. Бұл әңгіме бізді ежелгі түркі шаманизміне жетелейді. Көне түркілер бұл аталған құстарды киелі
деп санаған. Мысалы, ескі жылнамаларда жазылған аңыз бойынша көне түркілердің Ашина тайпасына жау шауып, жаппай қырып
кетеді. Сонда жалғыз қалған бала ғана аман қалады. Баланы қасқыр емізіп, аспан әлемінің елшісі – қарға ет әкеліп
асыраған. Осы баладан түркілердің ұрпағы деседі. Қазақтардың қарғаны киелі құс санағаны жөнінде дерек ер аз емес.
Қарға сөзімен байланысты мынадай мақал-мәтелдер бар: «Біздің де қолымызға қарға тышар», «Қарға тамырлы қазақ»,
«Қарғам-ау» деген сөз қарағым, қалқам деген мағынада қолданылады. «Қарғам, қарғашым, қарғатайым" деп қарттар
немере-шөберелерін еркелеткен. Қанша балаң бар деп жауап қайтарған.
Құрылымы

Арыстанбаб кесенесі ғасырлар бойы түрлі өндеу-жөндеуді басынан кешірген құрылыс.
Кейде Арыстанбабтың ХІ-ХІІ ғасырларда өмір сүргенін тілге тиек ете отырып, оның кесенесі Арыстанбаб дүние салған соң
іле-шала тұрғызылған деген жорамал айтылады. Алайда бізге жеткен қазіргі кесенеде ХІІ ғасырдың белгілері жоқ.
Бұл арада біз ислам дінінің алғашқы кезде қабыр үстіне төбесі жабық құрылыс тұрғызуға тыйым салғанын есте ұстағанымыз
жөн. Осы тұрғыдан қарағанда, ХІІ ғасырда Арыстанбаб ғимаратының болмауы да мүмкін. А.Черкасовтың жазбаларында
Арыстанбаб кесенесі әулие және шәкірттері жатқан екі бөлмеден, сондай-ақ алдындағы бастырмадан тұрғанын жоғарыда
айтқан болатынбыз. Бұлардың жобасы ХІV ғасырдың құрылысына сай келеді. Осымен қатар бастырмадағы ұстындар да ХІҮ
ғасырдың аяғы мен ХV ғасырдың басында жасалған деген тұжырымды мамандар айтқан болатын. Яғни қазіргі Арыстанбаб құрылыс
кешеніндегі қабырғаналар бөлігі ең көнесі, әуелгісі болып табылады. Бұған қоса халық арасында кең тараған мынадай
аңыз бар: «Қожа Ахмет кесенесінің қабырғалары қаланып болған түні алып жасыл өгіз көтерілген дуалдарды мүйізімен соғып,
құлатады. Ғимарат қабырғалары қайта тұрғызылып, күмбездері қалана бастағанда бұл оқиға тағы да қайталанып, бәрі
үйелген төбеге айналады. Бұл жай Әмір Темірді көп ойландырады. Түсінде бір шал келіп, аян береді, ол Қожа Ахметтің
ең алғашқы ұстазы, Арыстанбаб моласының үстіне мазар көтеруге әмір ететінін жеткізеді. Бұл талап орындалған соң ғана
Әмір Темір Түркістандағы құрылысын ойдағыдай аяқтайды». Арыстанбаб қабірханасының едені басқа бөлмелермен салыстырғанда
едәуір биік. Тігінен көтерілген қабырғалары бір биіктікте сәулет өнерінде «желкен» деп аталатын өріммен иіліп барым
күмбезге ұласады. Күмбез ауқымы кең, һәм биік етіп тұрғызылған. Қабірхананың есігі күнбатысқа, дәлірек айтсақ, Меккеге
бағышталған. Бұл қасиетті қабірлерге тағзым етудің мұсылмандық ережелерінен туындайды: зиярат етушінің беті сағанаға,
арқасы құбылаға қарауға тиіс болған. Оның ұзындығы 3 м. 90 см., ені 1 м. 30 см., биіктігі 1 м. 20 см. Қабаттас, көлемі
5,4м х 5,4 м. Бөлмеде үш қабір бар. Ол да биік күмбезбен жабылған. Алайда күмбездің іші алебастрмен сыланып,
геометриялық үлгідегі өрнектермен нақышталған. Әулиеге кірер есіктің екі жағында екі қабір орналасқан.
Шырақшылар бұларды Лашынбаб пен Қарғабаб дейді. Олар әулие қабірімен салыстырғанда аса шағын болып келген.
Лашын баб қабырының көлемі 1,63м х 0,92м., Қарғабабтікі 1,70 м х 0,90 м. Осы қабарханаларға оңтүстік-батыс жақтан
бірнеше бөлмелер қосылған. Екі қанаттағы бөлмелерді біріктіріп, байланыстырып тұрған дәліз-бастырма бар. Ол әдеттегі
бастырма-айвандардан өзгеше, тұтасымен қыштан өріліп, төбесі иіліп жабылған. Оның көлемі 7,60м х 4,35м. Қабырханалар,
дәліз қышпен қаланып күмбезделсе, мешіт бөлігі негізінен қам кесектен тұрғызылып, төбесін жабуда ағаш кең пайдаланылған.
Мешіттің ортасында В.В.Константинова жасаған жоба бойынша алты ағаш тіреу болған. Олардың үстіне қары қойылып, ағаштан
қырлы күмбез қиыстырылған. Мешіт қабырғасында Мекке бағытын көрсететін ойық-михраб бар
Зерттелуі

Арыстан баб ескерткіші деп аталатын мазарлар басқа аймақтардың бірі – Қырғызстандағы Ош өңірінде.
Бірақ қырғыздардың діни-нанымдарын зерттеген ғалым С.М.Абрамзонның пікірінше, жергілікті халық бұл жерде жерленген
Арыстанбабты қалмақтарға қарсы соғысқан батыр деп таниды. Яғни Оштағы Арыстанбаб XYII-XVII ғасырларда болған адам.
Арыстанбаб қабірінің басына тұрғызылған ғимарат алғаш ғылыми әдебиетте 1898 ж.ж. И.Т.Пославскийдің «Развалины города
Отрара» атты мақаласында аталады. 1903 жылы кесене түркістандық археология әуесқойлар үйірмесінің мүшесі А.Черкасовтың
Отырар төбені көріп айтқаны жөніндегі есебінде аталып өтіледі. А.Черкасовты түкпір бөлмедегі Арсытанбабтың қабірі таң
қалдырады: «Надгробие Арстан – Баба такой же формы, как и остальные, покрыто куском белого коленкора и поражает своими
размерами. Такого роста, по ловам шейха, достигал и сам святой...». А.Черкасовтың деректері кеінірек орыс-француз
тілдерінде жарық көрген. И.А.Кастеньенің «Древности Киргизской степи и Оренбургского края» деген еңбегінде де
қайталанады. Көп үзілістен кейін Арыстанбаб кесенесі жөніндегі ғылыми сипаттама 1950 ж.
В.В.Константинованың «Некоторые архитектурные памятники по среднему течению р.Сырдарьи» деген мақаласында жарияланды.
1987 жылы «Білім мен Еңбекте» М.Сембиннің кесене жайлы мақаласы жарияланды. М.Сембин Арыстанбаб туралы мақаласында
О.Дастановтың «Әулиелі жерлер туралы шындық» атты кітабындағы келтірілген мәліметтерге сүйене отырып, Арыстанбаб
кесенесінің сәулетшісі ташкенттік Ескендір қажы болған деген болатын. «Ол өзінше бір қайта жырау, тыңнан толғау,
немесе ақындық шабыт-шалым сынасып, жырмен жарысу есепті...»,- деген М.Әуезов сөздері Арыстанбаб сәулетшісіне
толығымен тән.
XXI ғасырдағы Арыстан баб кесенесі

Әлемге танымал “Арыстан баб” мавзолейінің құрылысы екі жыл бұрын жаңа архитектуралық кешен тұрғысында басталған.
Идея авторы – белгілі мемлекет және қоғам қайраткері, инженер-ғалым, танымал меценат Асқар Құлыбаев болып табылады.
Бір кездері Асқар Алтынбекұлы халық игілігі үшін рухани құндылық орнатуды армандаған. Бүгінде Асқар Құлыбаевтың және
оның ұлдарының Қазақстанның жан азығы байлығын еселей түсу мақсатындағы сіңірген үлесі зор екендігін айту қажет.
Елбасымыз Н.Ә.Назарбаев өзі бастама көтеріп, бүкіл мемлекеттік деңгейде жүзеге “Мәдени мұра” бағдарламасы асырылып
жатыр.

EOT;

























































































































































































































































































































































}
